[
	{
		"id": 1,
		"name": "Justin Enoch",
		"photo": "/people-justin.jpg",
		"bio": "Justin Enoch is a Romanian-born, LA-based sound designer, composer, and interdisciplinary artist. After graduating from Northwestern, their work has ranged from theatrically released features, interactive installations, and television mini-series to branded content, commercials, and Oscar winning shorts. In 2022, Justin’s second collaboration with director Olivia Peace, “Against Reality,” premiered at the 2022 Toronto International Film Festival and won a Gold Medal at the 2022 Student Academy Awards. Their feature, “Tahara (Dir. Olivia Peace)” was acquired by Film Movement and released theatrically in June 2022. It was subsequently named New York Times Critic’s Pick and one of Them Magazine’s Favorite LGBTQ+ Movies of 2022.\nJustin’s scoring work is featured in the upcoming season of Vice Media’s “Illegal Trade” and the standalone documentary “Red Sea Mission (Dir. Alex Chitty and Jacob Burghart)” as well as Paramount Picture’s 2021 series “Dream Team: Birth of the Modern Athlete (Dir. The Malloys).”\nJustin’s commercial clients include Tiffany & Co., Neiman Marcus, The New York Times, Suzuki, Salomon, and the Morocco Tourism Board. They have completed work for LA’s Stept Studios and Lockt Editorial and Chicago’s Some Odd Pilot. Their collaborations with director Brandon Lavoie have earned two Vimeo Staff Picks, an official selection at Mountainfilm Festival, and was shortlisted for the 2020 Cannes Young Director Award."
	},
	{
		"id": 2,
		"name": "Troy Lewis",
		"photo": "/people-troy.jpg",
		"bio": "Troy Lewis moved from Texas to Zambia at the age of 7, where he grew up in the capital, Lusaka. He is now a film editor based in Chicago. His work has screened at festivals such as Sundance and Outfest, and been featured on The Wrap's ShortList and PBS' AfroPop. His 2020 feature, Tahara, directed by Olivia Peace, premiered at Slamdance and is releasing in theaters, June 2022. In 2021, he edited the two-part Participant Media short film, A Revolutionary Act, exploring the family and legacy of Fred Hampton. His 2022 horror feature, All Jacked Up and Full of Worms, directed by Alex Phillips, premiered at Fantasia Film Festival, and he is currently completing editing on the feature documentary, Daughters. With a background in creative fiction writing, his editorial work focuses on depicting unique perspectives through the textures and rhythms of daily life, evoking emotion and insight through sensory experiences."
	}
]
