[
	{
		"id": 1,
		"name": "Justin Enoch",
		"photo": "/people-justin.jpg",
		"bio": "Justin Enoch is a Romanian-born, LA-based sound designer, composer, and interdisciplinary artist. After graduating from Northwestern, their work has ranged from theatrically released features, interactive installations, and television mini-series to branded content, commercials, and Oscar winning shorts. In 2024, Justin’s first collaboration with director Ben Gauthier, “Flail,” was selected for competition at Sundance. In addition to this selection, they completed work for director’s Alex Heller, Dan Pearlman, and Camille Casmier. Justin’s second collaboration with director Olivia Peace, “Against Reality,” premiered at the 2022 Toronto International Film Festival and won a Gold Medal at the 2022 Student Academy Awards. Their feature, “Tahara (Dir. Olivia Peace)” was acquired by Film Movement and released theatrically in June 2022. It was subsequently named New York Times Critic’s Pick and one of Them Magazine’s Favorite LGBTQ+ Movies of 2022. Justin’s scoring work is featured in the upcoming season of Vice Media’s “Illegal Trade” and the standalone documentary “Inside the Red Sea Mission (Dir. Alex Chitty and Jacob Burghart)” as well as Paramount Picture’s “Dream Team: Birth of the Modern Athlete (Dir. The Malloys).” Justin’s commercial clients include Arc'teryx, Salomon, Tiffany & Co., Neiman Marcus, The New York Times, Suzuki, and the Morocco Tourism Board. They have completed work for LA’s Stept Studios and Lockt Editorial, London’s FAMILIA, and Chicago’s Some Odd Pilot. Their 6 year collaboration with director Brandon Lavoie have earned two Vimeo Staff Picks and a Clio."
	},
	{
		"id": 2,
		"name": "Troy Lewis",
		"photo": "/people-troy.jpg",
		"bio": "Troy Lewis moved from Texas to Zambia at the age of 7, where he grew up in the capital, Lusaka. He is now a film editor based in Chicago. His work has screened at festivals such as Sundance and Outfest, and been featured on The Wrap's ShortList and PBS' AfroPop. His 2020 feature, Tahara, directed by Olivia Peace, premiered at Slamdance and is releasing in theaters, June 2022. In 2021, he edited the two-part Participant Media short film, A Revolutionary Act, exploring the family and legacy of Fred Hampton. His 2022 horror feature, All Jacked Up and Full of Worms, directed by Alex Phillips, premiered at Fantasia Film Festival, and he is currently completing editing on the feature documentary, Daughters. With a background in creative fiction writing, his editorial work focuses on depicting unique perspectives through the textures and rhythms of daily life, evoking emotion and insight through sensory experiences."
	},
	{
		"id": 3,
		"name": "Grace Hahn",
		"photo": "/people-troy.jpg",
		"bio": "Grace Hahn is a Chicago filmmaker who has produced feature films PRINCESS CYD [dir. Stephen Cone, 2017] and ONCE UPON A RIVER [dir. Haroula Rose, 2019]. She also produced the 2023 Slamdance-screening DON’T WORRY ABOUT IT [dir. Melissa Kong, 2023]. As a Line Producer, Grace recently headed Chicago local projects NIGHT'S END [dir. Jennifer Reeder, 2021] and ALL HAPPY FAMILIES [dir. Haroula Rose, 2023]. She was the Production Coordinator for the 2022 Tribeca hit THE YEAR BETWEEN [dir. Alex Heller, 2022] and the accountant for WHEN JEFF TRIED TO SAVE THE WORLD [dir. Kendall Goldberg, 2019]. Grace received the 2016 Aida Schvartz Award for Gender in Communication from Northwestern University and was part of the inaugural class of the Chicago Independent Producers Lab through the Chicago Film Office, DCASE, and Full Spectrum Features. She was recognized by NewCity as one of Chicago's 2020 Film50 "Screen Gems.""
	}
]
